{
  "Version": "000",
  "Year": "2024",
  "Semester": "Spring",
  "project_name": "Mapping and Analyzing Biopsy Lesions for Prostate Cancer",
  "Objective": " \n            The goal of this project is to develop a methodology to predict if a particular biopsied lesion of the prostate is \n            benign or malignant. This will allow doctors and other clinicians to better understand how to interpret specific, \n            suspicious Regions of Interest (ROIs) in a medical scan. It can also help doctors conduct biopsies in the future as if \n            certain localizations of prostate lesions lead to higher chances of malignant tumors. Identifying areas with higher \n            chances of malignancy could optimize biopsy procedures and remove discomfort for patients, as unnecessary biopsies \n            could be avoided. Accurately identifying malignant lesions can lead to earlier treatment and better patient outcomes.\n            ",
  "Dataset": "\n            This dataset is publicly available. \n\n            The dataset being used is part of a publicly available TCIA (The Cancer Imaging Archive) which contains thousands of \n            patients and their corresponding medical imaging data. This prostate cancer dataset contains 1151 patients with Prostate \n            MRI and Ultrasound with Pathology and Coordinates of Tracked Biopsies. For each of these patients, a set of anywhere from \n            30-60 images are provided as each patient has a slice of many MRI/Ultrasound images, in which the tracked biopsy is \n            contained within one of them. Ground truth cancer values, as well as cancer severity values are given in a target dataset. \n\n            We want to extrapolate the Region of Interest of the individual patient images using the biopsy coordinates and segment \n            the necessary images that contain regions where biopsies occurred. From there, I would like to feed those segmented images \n            into various different image classifications models to identify which produces the most optimal prediction accuracies on a \n            split training/testing/validation dataset. Furthermore, with the limited amounts of imaging, I hope to use techniques such \n            as k-fold cross validation to maximize the performance of the model, but limit overfitting problems. Focus on the relevant \n            regions of the image will allow the model to concentrate on the ROIs and therefore perform better. \n\n            In addition, such segmentation can also occur through the overlay of biospy files that are provided along with the dataset. \n            I will be working with 3D Slicer and in python to either automate the region of interest using the biopsy tracked coordinates,\n            or through the biospy overlay files with 3D Slicer + Python code. \n            ",
  "Rationale": "\n            This project is going to help doctors make more informed decisions about how to biopsy and diagnose prostate cancer.\n            ",
  "Approach": "\n            I plan on approaching this capstone through several steps.  \n\n            1. Loading Image Data and Separating Images for Individual Patients\n            2. Mapping Biopsy Coordinates onto the Corresponding Patient Images \n            3. Create Classification Deep Learning Model to Predict Biopsy Diagnosis\n            4. Evaluate and Improve Model \n            ",
  "Timeline": "\n            This a rough time line for this project:  \n\n            - (1 Week) Data Loading\n            - (3 Weeks) Image Segmentation Automation Using Biopsy Coordinates and/or Biopsy Overlay Files\n            - (3 Weeks) Classification Model Creation  \n            - (3 Weeks) Evaluate and Improve Model Training using Train/Test/Validation Split\n            - (1 Weeks) Compiling Results  \n            - (1 Weeks) Writing Up a paper and submission\n            - (1 Weeks) Final Presentation  \n            ",
  "Expected Number Students": "\n            For this project, the expected number of students on this project is one.  \n            ",
  "Possible Issues": "\n            The challenge will be on the segmentation and data analysis part to ensure proper mapping, and if not, to still \n            maintain that the model will predict well on the patient images. Furthermore, figuring out how to automate the segmentation\n            of the images using either the biopsy coordinates or the biopsy overlay files via 3D slicer, and understanding how to subsequently\n            load those segmented files into Python is something I have never done and will take some time.\n            ",
  "Proposed by": "Arjun Moorthy",
  "Proposed by email": "arjunkmoorthy@gwu.edu",
  "instructor": "Edwin Lo",
  "instructor_email": "edwinlo@gwu.edu",
  "github_repo": "https://github.com/arjunkmoorthy1/24Spr_AMoorthy_healthai.git "
}